; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v7 ?v6)
             (pred_12 ?v11 ?v2)
             (pred_4 ?v7 ?v2)
             (pred_8 ?v8 ?v7 )
	     (pred_6 ?v7)
             (pred_9 ?v9)
             (pred_7 ?v11)
             (pred_2 ?v2)
             (pred_11 ?v7)
             (pred_3 ?v11)
             (pred_5 ?v7)
             (pred_1 ))



(:action op_2
:parameters (?v4 ?v10 ?v1 ?v13)
:precondition (and (pred_9 ?v4) (pred_9 ?v10) (pred_7 ?v1) (pred_2 ?v13)
          (pred_10 ?v4 ?v10) (pred_12 ?v1 ?v13)
                   (pred_4 ?v10 ?v13) (pred_6 ?v4) 
                   (pred_11 ?v10) (pred_3 ?v1))
:effect (and  (pred_5 ?v10) (not (pred_11 ?v10))))


(:action op_1
:parameters (?v4 ?v5)
:precondition (and (pred_9 ?v4) (pred_9 ?v5)
               (pred_6 ?v4) (pred_10 ?v4 ?v5) (pred_5 ?v5))
:effect (and (pred_6 ?v5) (not (pred_6 ?v4))))

(:action op_4
:parameters (?v4 ?v1)
:precondition (and (pred_9 ?v4) (pred_7 ?v1) 
                  (pred_6 ?v4) (pred_8 ?v1 ?v4) (pred_1 ))
:effect (and (pred_3 ?v1)
   (not (pred_8 ?v1 ?v4)) (not (pred_1 ))))


(:action op_3
:parameters (?v4 ?v3 ?v12)
:precondition (and (pred_9 ?v4) (pred_7 ?v3) (pred_7 ?v12)
                  (pred_6 ?v4) (pred_3 ?v12) (pred_8 ?v3 ?v4))
:effect (and (pred_3 ?v3) (pred_8 ?v12 ?v4)
        (not (pred_3 ?v12)) (not (pred_8 ?v3 ?v4))))

(:action op_5
:parameters (?v4 ?v1)
:precondition (and (pred_9 ?v4) (pred_7 ?v1) 
                  (pred_6 ?v4) (pred_3 ?v1))
:effect (and (pred_1 ) (pred_8 ?v1 ?v4) (not (pred_3 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_30 obj_27 obj_19 obj_09 obj_03 obj_16 obj_13 obj_14 obj_17 obj_25 obj_11 obj_12 obj_02 obj_07 obj_23 obj_01 obj_15 obj_10 obj_08 obj_04 obj_24 obj_28 obj_29 obj_05
    obj_20 obj_21
    obj_26 obj_22 obj_06
    )

    (:init
       (pred_1)

       (pred_9 obj_18)
       (pred_9 obj_30)
       (pred_9 obj_27)
       (pred_9 obj_19)
       (pred_9 obj_09)
       (pred_9 obj_03)
       (pred_9 obj_16)
       (pred_9 obj_13)
       (pred_9 obj_14)
       (pred_9 obj_17)
       (pred_9 obj_25)
       (pred_9 obj_11)
       (pred_9 obj_12)
       (pred_9 obj_02)
       (pred_9 obj_07)
       (pred_9 obj_23)
       (pred_9 obj_01)
       (pred_9 obj_15)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_04)
       (pred_9 obj_24)
       (pred_9 obj_28)
       (pred_9 obj_29)
       (pred_9 obj_05)
       (pred_2 obj_20)
       (pred_2 obj_21)
       (pred_7 obj_26)
       (pred_7 obj_22)
       (pred_7 obj_06)

       (pred_10 obj_18 obj_03)
       (pred_10 obj_18 obj_30)
       (pred_10 obj_30 obj_16)
       (pred_10 obj_30 obj_27)
       (pred_10 obj_30 obj_18)
       (pred_10 obj_27 obj_13)
       (pred_10 obj_27 obj_19)
       (pred_10 obj_27 obj_30)
       (pred_10 obj_19 obj_14)
       (pred_10 obj_19 obj_09)
       (pred_10 obj_19 obj_27)
       (pred_10 obj_09 obj_17)
       (pred_10 obj_09 obj_19)
       (pred_10 obj_03 obj_25)
       (pred_10 obj_03 obj_16)
       (pred_10 obj_03 obj_18)
       (pred_10 obj_16 obj_11)
       (pred_10 obj_16 obj_13)
       (pred_10 obj_16 obj_30)
       (pred_10 obj_16 obj_03)
       (pred_10 obj_13 obj_12)
       (pred_10 obj_13 obj_14)
       (pred_10 obj_13 obj_27)
       (pred_10 obj_13 obj_16)
       (pred_10 obj_14 obj_02)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_19)
       (pred_10 obj_14 obj_13)
       (pred_10 obj_17 obj_07)
       (pred_10 obj_17 obj_09)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_25 obj_23)
       (pred_10 obj_25 obj_11)
       (pred_10 obj_25 obj_03)
       (pred_10 obj_11 obj_01)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_11 obj_16)
       (pred_10 obj_11 obj_25)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_02)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_02 obj_14)
       (pred_10 obj_02 obj_12)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_07 obj_17)
       (pred_10 obj_07 obj_02)
       (pred_10 obj_23 obj_04)
       (pred_10 obj_23 obj_01)
       (pred_10 obj_23 obj_25)
       (pred_10 obj_01 obj_24)
       (pred_10 obj_01 obj_15)
       (pred_10 obj_01 obj_11)
       (pred_10 obj_01 obj_23)
       (pred_10 obj_15 obj_28)
       (pred_10 obj_15 obj_10)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_15 obj_01)
       (pred_10 obj_10 obj_29)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_15)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_04 obj_24)
       (pred_10 obj_04 obj_23)
       (pred_10 obj_24 obj_28)
       (pred_10 obj_24 obj_01)
       (pred_10 obj_24 obj_04)
       (pred_10 obj_28 obj_29)
       (pred_10 obj_28 obj_15)
       (pred_10 obj_28 obj_24)
       (pred_10 obj_29 obj_05)
       (pred_10 obj_29 obj_10)
       (pred_10 obj_29 obj_28)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_29)
       (pred_11 obj_17)
       (pred_11 obj_23)
       (pred_11 obj_29)
       (pred_4  obj_17 obj_20)
       (pred_4  obj_23 obj_21)
       (pred_4  obj_29 obj_21)
       (pred_5 obj_18)
       (pred_5 obj_30)
       (pred_5 obj_27)
       (pred_5 obj_19)
       (pred_5 obj_09)
       (pred_5 obj_03)
       (pred_5 obj_16)
       (pred_5 obj_13)
       (pred_5 obj_14)
       (pred_5 obj_25)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_02)
       (pred_5 obj_07)
       (pred_5 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_04)
       (pred_5 obj_24)
       (pred_5 obj_28)
       (pred_5 obj_05)

       (pred_12  obj_26 obj_20)
       (pred_12  obj_22 obj_21)
       (pred_12  obj_06 obj_20)
       (pred_8 obj_26 obj_02)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_06 obj_13)
       (pred_6 obj_27)
    )

    (:goal (and
       (pred_8 obj_26 obj_15)
       (pred_8 obj_06 obj_01)
    ))
(:constraints
  (always (not (pred_6 obj_12)))
)
)

; plan
1. (op_1 obj_27 obj_13)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_13)
   goals met: 0 of 2
2. (op_4 obj_13 obj_06)
   deleted: (pred_8 obj_06 obj_13) (pred_1)
   added: (pred_3 obj_06)
   goals met: 0 of 2
3. (op_1 obj_13 obj_14)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_14)
   goals met: 0 of 2
4. (op_1 obj_14 obj_02)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_02)
   goals met: 0 of 2
5. (op_3 obj_02 obj_26 obj_06)
   deleted: (pred_3 obj_06) (pred_8 obj_26 obj_02)
   added: (pred_3 obj_26) (pred_8 obj_06 obj_02)
   goals met: 0 of 2
6. (op_1 obj_02 obj_10)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_10)
   goals met: 0 of 2
7. (op_1 obj_10 obj_15)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_15)
   goals met: 0 of 2
8. (op_5 obj_15 obj_26)
   deleted: (pred_3 obj_26)
   added: (pred_1) (pred_8 obj_26 obj_15)
   goals met: 1 of 2
9. (op_1 obj_15 obj_10)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_10)
   goals met: 1 of 2
10. (op_1 obj_10 obj_02)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_02)
   goals met: 1 of 2
11. (op_4 obj_02 obj_06)
   deleted: (pred_8 obj_06 obj_02) (pred_1)
   added: (pred_3 obj_06)
   goals met: 1 of 2
12. (op_1 obj_02 obj_10)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_10)
   goals met: 1 of 2
13. (op_1 obj_10 obj_15)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_15)
   goals met: 1 of 2
14. (op_1 obj_15 obj_01)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_01)
   goals met: 1 of 2
15. (op_5 obj_01 obj_06)
   deleted: (pred_3 obj_06)
   added: (pred_1) (pred_8 obj_06 obj_01)
   goals met: 2 of 2
